---
kind: type
id: T:Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException
source: html/b9b68e56-c767-4680-a65b-73d268ee8860.htm
---
# Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException

The exception that is thrown when an unauthenticated user attempts to initiate a call to RevitServer.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RevitServerUnauthenticatedUserException : RevitServerException
```